Revit 2026 API

# TaskDialogTitleAutoPrefix Property

---

Whether the TaskDialog's title will automatically have the add-in name added as a prefix.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool TitleAutoPrefix { get; set; }
```
```vb
Public Property TitleAutoPrefix As Boolean
	Get
	Set
```
```cpp
public:
property bool TitleAutoPrefix {
	bool get ();
	void set (bool value);
}
```
```fsharp
member TitleAutoPrefix : bool with get, set
```

#### Property Value

Boolean

The default value is true.

#### Reference

TaskDialog Class

Autodesk.Revit.UI Namespace